app/controllers/portfolios_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def show

    # Cloudinary::Api.resources resource_type: 'raw', type: 'upload',  prefix: 't7'

    # binding.pry
    @portfolio = Portfolio.find params[:id]

INSERT INTO "portfolios" ("title", "subtitle", "content", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---


    respond_to do |format|
      if @portfolio.save

UPDATE "portfolios" SET "title" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["title", ""], ["updated_at", "2020-03-05 08:22:09.833620"], ["id", 43]]
---
  def update
    respond_to do |format|
      if @portfolio.update(portfolio_params)

DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 9]]
---
  def destroy
    @portfolio.destroy

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
    def set_portfolio
      @portfolio = Portfolio.find(params[:id])